# Table of Contents
## 01. Importing Libraries
## 02. Importing dataframes
## 03. Check the shape of the imported data frames
## 04. Merge Dataframes
## 05. Export Dataframe

# 01 Importing libraries

In [1]:
# Importing libraries
import pandas as pd
import numpy as np
import os

# 02 Importing data

In [2]:
# Importing orders_products_combined dataframe
orders_products_combined=pd.read_pickle('../02 Data/Prepared Data/orders_products_combined.pkl')

In [3]:
# Importing products_checked data frame
products_checked=pd.read_csv(('../02 Data/Prepared Data/products_checked.csv'),index_col=0)

# 03 Check the shape of the imported data frames

In [4]:
orders_products_combined.shape

(32434489, 11)

In [5]:
orders_products_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,first_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,Yes,196,1,0,both
1,2539329,1,1,2,8,NaN,Yes,14084,2,0,both
2,2539329,1,1,2,8,NaN,Yes,12427,3,0,both
3,2539329,1,1,2,8,NaN,Yes,26088,4,0,both
4,2539329,1,1,2,8,NaN,Yes,26405,5,0,both

In [6]:
ords_prods_comb_drop=orders_products_combined.drop(columns=['_merge'])

In [9]:
ords_prods_comb_drop.shape

(32434489, 10)

In [8]:
ords_prods_comb_drop.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,first_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,Yes,196,1,0
1,2539329,1,1,2,8,NaN,Yes,14084,2,0
2,2539329,1,1,2,8,NaN,Yes,12427,3,0
3,2539329,1,1,2,8,NaN,Yes,26088,4,0
4,2539329,1,1,2,8,NaN,Yes,26405,5,0

In [10]:
products_checked.shape

(49672, 5)

In [11]:
products_checked.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [16]:
ords_prods_comb_drop.describe().applymap('{:,.2f}'.format)

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered
count,"32,434,489.00","32,434,489.00","32,434,489.00","32,434,489.00","32,434,489.00","30,356,421.00","32,434,489.00","32,434,489.00","32,434,489.00"
mean,"1,710,748.52","102,937.24",17.14,2.74,13.42,11.10,"25,576.34",8.35,0.59
std,"987,300.70","59,466.48",17.54,2.09,4.25,8.78,"14,096.69",7.13,0.49
min,2.00,1.00,1.00,0.00,0.00,0.00,1.00,1.00,0.00
25%,"855,943.00","51,421.00",5.00,1.00,10.00,5.00,"13,530.00",3.00,0.00
50%,"1,711,048.00","102,611.00",11.00,3.00,13.00,8.00,"25,256.00",6.00,1.00
75%,"2,565,514.00","154,391.00",24.00,5.00,16.00,15.00,"37,935.00",11.00,1.00
max,"3,421,083.00","206,209.00",99.00,6.00,23.00,30.00,"49,688.00",145.00,1.00

In [13]:
ords_prods_comb_drop.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32434489 entries, 0 to 32434488
Data columns (total 10 columns):
 #   Column                 Dtype
---  ------                 -----
 0   order_id               int64
 1   user_id                int64
 2   order_number           int64
 3   orders_day_of_week     int64
 4   order_hour_of_day      int64
 5   days_since_last_order  float64
 6   first_order            object
 7   product_id             int32
 8   add_to_cart_order      int32
 9   reordered              int8
dtypes: float64(1), int32(2), int64(5), int8(1), object(1)
memory usage: 2.2+ GB

In [18]:
ords_prods_comb_drop['order_id'] = ords_prods_comb_drop['order_id'].astype('int32')
ords_prods_comb_drop['user_id']=ords_prods_comb_drop['user_id'].astype('int32')
ords_prods_comb_drop['order_number']=ords_prods_comb_drop['order_number'].astype('int8')
ords_prods_comb_drop['orders_day_of_week']=ords_prods_comb_drop['orders_day_of_week'].astype('int8')
ords_prods_comb_drop['order_hour_of_day']=ords_prods_comb_drop['order_hour_of_day'].astype('int8')
ords_prods_comb_drop['first_order']=ords_prods_comb_drop['first_order'].astype('category')

In [19]:
ords_prods_comb_drop.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32434489 entries, 0 to 32434488
Data columns (total 10 columns):
 #   Column                 Dtype
---  ------                 -----
 0   order_id               int32
 1   user_id                int32
 2   order_number           int8
 3   orders_day_of_week     int8
 4   order_hour_of_day      int8
 5   days_since_last_order  float64
 6   first_order            category
 7   product_id             int32
 8   add_to_cart_order      int32
 9   reordered              int8
dtypes: category(1), float64(1), int32(4), int8(4)
memory usage: 1.1 GB

# 04 Merge Data frames

In [20]:
# Merge ords_prods_comb_drop and products_checked data on "product_id" column
df_merged=ords_prods_comb_drop.merge(products_checked,on='product_id',indicator=True)

In [21]:
# Check output
df_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,first_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,Yes,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,No,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,No,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,No,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,No,196,1,1,Soda,77,7,9.0,both

In [22]:
df_merged.shape

(32404859, 15)

In [23]:
df_merged['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

# 05 Exporting merged data frame

In [24]:
# Export orders_products_merged data to pkl

df_merged.to_pickle('../02 Data/Prepared Data/orders_products_merged.pkl')